{
    "a": "You make friends easily but must guard against becoming involved in the affairs of others or being too easily led.", 
    "b": "You could do well working with the public giving advice, where you can use your skills in diplomacy in handling people, but where you are not under pressure or required to carry responsibility and make decisions.", 
    "c": "You find it difficult to make snap decisions and to occupy a leadership position as you lack self-confidence.", 
    "d": "You dislike heavy manual work; as well, you are inclined to put plans off until forced to take action.", 
    "e": "You find it difficult to be systematic in business and you dislike budgeting.", 
    "f": "Without the encouragement of others, you lack the energy, confidence, or initiative required to bring an idea to fruition.", 
    "g": "You dislike facing issues or witnessing hurt feelings.", 
    "h": "You could be inventive along scientific or technical lines.", 
    "i": "Although you are not naturally spontaneous in musical or artistic expression, you can develop technical proficiency along these lines.", 
    "j": "You are fussy about details and seek perfection in whatever you undertake.", 
    "k": "Being somewhat wilful and skeptical, you learn best through your own experiences and seek proof though facts.", 
    "l": "You work best alone, making your own decisions, and learning from your own experiences.", 
    "m": "Despite your loyalty to friends, your communication at times is stilted, too candid, and frank.", 
    "n": "You are responsible and generous, although somewhat scattering and disorganized at times.", 
    "o": "Any jobs requiring systematic and conscientious effort, or involving any form of drudgery, dismay you.", 
    "p": "In your work, you would seek a position offering self-expression through contact with people, such as sales or teaching, or a position giving scope to your creative, artistic talents.", 
    "q": "You are good-natured and likeable, and people tend to confide in you and seek your advice in personal problems.", 
    "r": "Others sense your sincere interest and desire to help, and you can always be counted on to see the bright side of any problem.", 
    "s": "Your optimism can be a source of inspiration to others as well as yourself.", 
    "t": "In close personal relationships you are usually thoughtful and considerate.", 
    "u": "However, your natural interest in others, coupled with your sympathetic reaction to problems, could draw you into emotional situations which may be difficult to get out of.", 
    "v": "You could have musical or artistic talents but find it difficult to concentrate your efforts in one area long enough to accomplish anything.", 
    "w": "Spontaneous, happy-go-lucky, and expressive yourself, you like to see people happy and go out of your way to create harmony amongst them.", 
    "x": "Too idealistic and impractical through the use of this name, you would not find it easy to make a success in the business world.", 
    "y": "You are inclined to procrastinate and let things slide and to make promises that you find difficult to fulfil although you have the best of intentions.", 
    "z": "You find it difficult to discipline your desires and emotional feelings."
}

 

 

 

 

 

 

 

 
 


 

 



 
 

 

 

 
